openfoam/caseTemplate/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    writeInterval   1;

    log             yes;

    patches         (plane);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.225;           // Required when rho = rhoInf
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // wing leading edge
    pitchAxis       (0 1 0);
    magUInf         10;
    lRef            1.4;        // wing span
    Aref            0.238;       // Projected wing area
    // chord len: 0.173m
}

/*
binField1
{
    type                    binField;
    libs                    (fieldFunctionObjects);
    binModel                singleDirectionUniformBin;
    fields                  (forceCoeff);
    patches                 (motorBikeGroup);
    decomposePatchValues    true;
    CofR                    ${../forceCoeffs1/CofR};

    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    writeControl            timeStep;
}
*/


// ************************************************************************* //
